/*---------------------------------------------------------------------*/
/* --- STC MCU Limited ------------------------------------------------*/
/* --- STC 1T Series MCU Demo Programme -------------------------------*/
/* --- Mobile: (86)13922805190 ----------------------------------------*/
/* --- Fax: 86-0513-55012956,55012947,55012969 ------------------------*/
/* --- Tel: 86-0513-55012928,55012929,55012966 ------------------------*/
/* --- Web: www.STCAI.com ---------------------------------------------*/
/* --- Web: www.STCMCUDATA.com  ---------------------------------------*/
/* --- BBS: www.STCAIMCU.com  -----------------------------------------*/
/* --- QQ:  800003751 -------------------------------------------------*/
/* 如果要在程序中使用此代码,请在程序中注明使用了STC的资料及程序            */
/*---------------------------------------------------------------------*/

#ifndef	__SOFT_CONVERT_H
#define	__SOFT_CONVERT_H


void	convert16to8(int16 *input, u8 *output, u16 length); 	//16位数组转存8位数组中
void	convert8to16(u8 *input, int16 *output, u16 length);	//8位数组转存16位数组中
void	convert32to8(int32 *input, u8 *output, u16 length);
void	convert8to32(u8 *input, int32 *output, u16 length);

#endif

